In [3]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f',
'h'],columns=['one', 'two', 'three'])

df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df

        one       two     three
a -0.130434  0.112904 -0.507169
b       NaN       NaN       NaN
c  0.850281 -2.008218  0.368606
d       NaN       NaN       NaN
e -1.262141  0.562711 -0.751320
f  1.020973  1.349308 -0.778831
g       NaN       NaN       NaN
h  0.229524 -0.328459 -0.123125

In [11]:
import numpy as np
import pandas as pd
data = np.array(['a','b','c','d'])
#data
s = pd.Series(data)

In [12]:
#index
s = pd.Series(data,index=[8,9,6,5])
s

8    a
9    b
6    c
5    d
dtype: object

In [23]:
#dictonary
dict = {'a':6.,'b':9.}
se = pd.Series(dict)
se

a    6.0
b    9.0
dtype: float64

In [24]:
se[0]

6.0

In [25]:
se[:3]

a    6.0
b    9.0
dtype: float64

In [27]:
se['a']

6.0

In [29]:
#Data Frame
#create empty dataframe

import pandas as pd
df = pd.DataFrame()
data

Empty DataFrame
Columns: []
Index: []

In [31]:
#create list data frame
data=[4,5,6,7,8,9]
df = pd.DataFrame(data)
df

   0
0  4
1  5
2  6
3  7
4  8
5  9

In [33]:
#using column
data = [['anix',55],['bul',66],['altap',77]]
df = pd.DataFrame(data, columns=['name','age'])
df

    name  age
0   anix   55
1    bul   66
2  altap   77

In [35]:
import pandas as pd
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data)
df

   Age   Name
0   28    Tom
1   34   Jack
2   29  Steve
3   42  Ricky

In [38]:
import pandas as pd
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])
df

       Age   Name
rank1   28    Tom
rank2   34   Jack
rank3   29  Steve
rank4   42  Ricky

In [40]:
import pandas as pd
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data)
df

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [44]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]

#With two column indices, values same as dictionary keys
df1 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b'])

#With two column indices with one index with other name
df2 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b1'])
df1
df2

        a  b1
first   1 NaN
second  5 NaN

In [46]:
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [50]:

# Using the previous DataFrame, we will delete a column
# using del function
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']), 
   'three' : pd.Series([10,20,30], index=['a','b','c'])}

df = pd.DataFrame(d)
print ("Our dataframe is:")
df

# using del function
print ("Deleting the first column using DEL function:")
del df['one']
df

# using pop function
print ("Deleting another column using POP function:")
df.pop('two')
df

Our dataframe is:
Deleting the first column using DEL function:
Deleting another column using POP function:

   three
a   10.0
b   20.0
c   30.0
d    NaN

In [52]:


d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)

# Adding a new column to an existing DataFrame object with column label by passing new series

print ("Adding a new column by passing as Series:")
df['three']=pd.Series([10,20,30],index=['a','b','c'])
df 

print ("Adding a new column using the existing columns in DataFrame:")
df['four']=df['one']+df['three']

df

Adding a new column by passing as Series:
Adding a new column using the existing columns in DataFrame:

   one  two  three  four
a  1.0    1   10.0  11.0
b  2.0    2   20.0  22.0
c  3.0    3   30.0  33.0
d  NaN    4    NaN   NaN

In [54]:
#Deletion of Rows
import pandas as pd

df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

df = df.append(df2)

# Drop rows with label 0
df = df.drop(0)

df

   a  b
1  3  4
1  7  8

In [58]:
#adding row
import pandas as pd

df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

df = df.append(df2)
df

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [59]:
#slicing row
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
df[2:4]

   one  two
c  3.0    3
d  NaN    4

In [61]:
# creating an empty panel
import pandas as pd
import numpy as np
data = {'Item1' : pd.DataFrame(np.random.randn(4, 3)), 
   'Item2' : pd.DataFrame(np.random.randn(4, 2))}
p = pd.Panel(data)
p.minor_xs(1)

      Item1     Item2
0 -0.819451  1.279933
1  2.366296  0.140231
2  0.806618 -0.705177
3  0.558401  0.404983

In [63]:
# pandas basic funtionality
import pandas as pd
import numpy as np

#Create a series with 100 random numbers
s = pd.Series(np.random.randn(4))
s

0    0.619593
1   -0.319609
2   -2.136624
3    1.064930
dtype: float64

In [66]:

import pandas as pd
import numpy as np

#Create a series with 4 random numbers
s = pd.Series(np.random.randn(4))
print ("The original series is:")


print ("The last two rows of the data series:")
s.tail(2)

The original series is:
The last two rows of the data series:

2   -0.041123
3    1.513283
dtype: float64

In [67]:
Sr.No.	Attribute or Method & Description
1	
T

Transposes rows and columns.

2	
axes

Returns a list with the row axis labels and column axis labels as the only members.

3	
dtypes

Returns the dtypes in this object.

4	
empty

True if NDFrame is entirely empty [no items]; if any of the axes are of length 0.

5	
ndim

Number of axes / array dimensions.

6	
shape

Returns a tuple representing the dimensionality of the DataFrame.

7	
size

Number of elements in the NDFrame.

8	
values

Numpy representation of NDFrame.

9	
head()

Returns the first n rows.

10	
tail()

Returns last n rows.

SyntaxError: invalid syntax (<ipython-input-67-836453832f0c>, line 5)

In [69]:
# missing value
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f',
'h'],columns=['one', 'two', 'three'])

df

        one       two     three
a  0.625342 -2.896715 -0.193937
c  2.053027 -0.490852 -1.485369
e  2.590695  2.226974  0.325145
f  0.328191 -0.163925  0.784395
h  0.772020  0.860518  1.361972

In [71]:
# missing value insert

df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df

        one       two     three
a  0.625342 -2.896715 -0.193937
b       NaN       NaN       NaN
c  2.053027 -0.490852 -1.485369
d       NaN       NaN       NaN
e  2.590695  2.226974  0.325145
f  0.328191 -0.163925  0.784395
g       NaN       NaN       NaN
h  0.772020  0.860518  1.361972

In [74]:
df['one'].isnull()

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [76]:
df['one'].notnull()

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

In [78]:
df['one'].sum()

6.369275377433247

In [83]:
df.fillna(4)

        one       two     three
a -2.451770  1.260056  1.254306
b  4.000000  4.000000  4.000000
c -0.641375  0.533768 -1.770292
f  4.000000  4.000000  4.000000
d  4.000000  4.000000  4.000000

In [85]:
df = pd.DataFrame(np.random.randn(3, 3), index=['a', 'c', 'e'],columns=['one',
'two', 'three'])

df = df.reindex(['a', 'b', 'c','f','d'])
df

        one       two     three
a  0.977211  0.028099  0.618052
b       NaN       NaN       NaN
c  0.042902 -0.370834  0.810812
f       NaN       NaN       NaN
d       NaN       NaN       NaN

In [90]:
df.fillna(5)

        one       two     three
a  0.977211  0.028099  0.618052
b  5.000000  5.000000  5.000000
c  0.042902 -0.370834  0.810812
f  5.000000  5.000000  5.000000
d  5.000000  5.000000  5.000000

In [92]:
df

        one       two     three
a  0.977211  0.028099  0.618052
b       NaN       NaN       NaN
c  0.042902 -0.370834  0.810812
f       NaN       NaN       NaN
d       NaN       NaN       NaN

In [95]:
df = pd.DataFrame({'one':[10,20,30,40,50,2000], 'two':[1000,0,30,40,50,60]})
df

    one   two
0    10  1000
1    20     0
2    30    30
3    40    40
4    50    50
5  2000    60

In [96]:
df.replace({1000:10,2000:60})

   one  two
0   10   10
1   20    0
2   30   30
3   40   40
4   50   50
5   60   60